OpenFOAM-v1806/tutorials/multiphase/icoReactingMultiPhaseInterFoam/solidMelting2D/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 301.3;

boundaryField
{
    left
    {
        type           fixedValue;
        value          uniform 311;
    }
    right
    {
        type           inletOutlet;
        inletValue     $internalField;
        value          $internalField;

    }
    bottom
    {
        type            zeroGradient;
        value           $internalField;
    }
    top
    {
        type            zeroGradient;
        value           $internalField;
    }
    frontAndBack
    {
        type           empty;
    }
}

// ************************************************************************* //
